{
  "appliance_type": "Dishwasher",
  "symptom": "Not cleaning dishes properly",
  "symptom_id": "Not-Cleaning-Properly",
  "url": "https://www.partselect.com/Repair/Dishwasher/Not-Cleaning-Properly/",
  "overview": "Determine why your dishwasher will not clean properly by troubleshooting parts, like housing gaskets, spray arms, water deliver tubes and filters.",
  "repair_solutions": [
    {
      "name": "Upper Discharge Housing Gasket",
      "id": "UpperDischargeHousing",
      "content": "If you are experiencing low pressure from the spray arms, the upper discharge housing gasket could be the source of the problem.\n\nHow to inspect a dishwasher upper discharge housing gasket:\n\nFor safety, unplug your dishwasher before starting this repair. This housing gasket is located on the discharge cover above the circulation impeller. The gasket may have just come loose, or it may need to be replaced altogether. Locate your gasket in order to inspect it. Inspect the gasket for any signs of wear, damage, cracking, missing chunks, and if it is properly attached. If it is loose, ensure that there is no debris that is preventing a proper seal and then reattach it. If you find your housing gasket is damaged or worn, you will need a replacement upper discharge housing gasket .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "For safety, unplug your dishwasher before starting this repair."
        },
        {
          "title": "Step 2",
          "content": "This housing gasket is located on the discharge cover above the circulation impeller. The gasket may have just come loose, or it may need to be replaced altogether. Locate your gasket in order to inspect it."
        },
        {
          "title": "Step 3",
          "content": "Inspect the gasket for any signs of wear, damage, cracking, missing chunks, and if it is properly attached. If it is loose, ensure that there is no debris that is preventing a proper seal and then reattach it."
        },
        {
          "title": "Step 4",
          "content": "If you find your housing gasket is damaged or worn, you will need areplacement upper discharge housing gasket."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2098976_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2098976_2_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2097779_1_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement upper discharge housing gasket",
          "category": "Dishwasher Seals and Gaskets",
          "url": "https://www.partselect.com/Dishwasher-Seals-and-Gaskets.htm"
        }
      ]
    },
    {
      "name": "Spray Arm",
      "id": "SprayArm",
      "content": "The lower spray arm (as well as the upper and middle spray arms if applicable) could be the reason why your dishwasher is not cleaning properly. The function of the spray arms is to spray the dishes with a strong stream of hot water and detergent. If some of the holes are plugged, then you should also inspect the filter system for a possible problem. Cracks or separated seams in the spray arms will impair the force of the spray as well. If your dishwasher has an upper spray arm also inspect the spray arm mounting bracket to make sure it hasn't become loose, cracked or otherwise restricted.\n\nHow to inspect dishwasher spray arms:\n\nDisconnect the appliance from the power source before beginning. Open your dishwasher and visually inspect your spray arms. You are looking for any signs of wear, cracking, or damage. Inspect the holes of the arms to see if any dirt or debris is lodged in them, clean out anything you find. Turn the spray arms manually. While doing so, you should be inspecting if there is much resistance, if the arms are wobbling, or if the arms hit the dish racks. If your spray arms show any of the above symptoms, you will need replacement spray arms .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Disconnect the appliance from the power source before beginning."
        },
        {
          "title": "Step 2",
          "content": "Open your dishwasher and visually inspect your spray arms. You are looking for any signs of wear, cracking, or damage. Inspect the holes of the arms to see if any dirt or debris is lodged in them, clean out anything you find."
        },
        {
          "title": "Step 3",
          "content": "Turn the spray arms manually. While doing so, you should be inspecting if there is much resistance, if the arms are wobbling, or if the arms hit the dish racks."
        },
        {
          "title": "Step 4",
          "content": "If your spray arms show any of the above symptoms, you will needreplacement spray arms."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/260604_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/1524954_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/1524954_2_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement spray arms",
          "category": "Dishwasher Spray Arms",
          "url": "https://www.partselect.com/Dishwasher-Spray-Arms.htm"
        }
      ]
    },
    {
      "name": "Docking Station",
      "id": "DockingStation",
      "content": "If your dishwasher has a middle spray arm attached to an adjustable upper rack, then you should inspect the docking station along with its flappers. The docking provides water to the middle spray arm and usually has two outlets.\n\nHow to inspect a dishwasher docking station:\n\nBefore beginning this inspection, disconnect the power supply from your appliance. The docking station can be found at the back of the dishwasher on the water supply tube. Locate your docking station in order to inspect it. Begin by checking to see if the docking station is connected securely to the water supply tube. Next, check the flappers to make sure they can move freely and that they will close securely. You should also inspect all components, particularly the plastic pieces, of the docking station for signs of cracking, wear, or damage. If you find any issues while performing the checks above, you will need a replacement docking station .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Before beginning this inspection, disconnect the power supply from your appliance."
        },
        {
          "title": "Step 2",
          "content": "The docking station can be found at the back of the dishwasher on the water supply tube. Locate your docking station in order to inspect it."
        },
        {
          "title": "Step 3",
          "content": "Begin by checking to see if the docking station is connected securely to the water supply tube. Next, check the flappers to make sure they can move freely and that they will close securely. You should also inspect all components, particularly the plastic pieces, of the docking station for signs of cracking, wear, or damage."
        },
        {
          "title": "Step 4",
          "content": "If you find any issues while performing the checks above, you will need areplacement docking station."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2340934_2_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2340934_4_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2340934_1_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement docking station",
          "category": "Dishwasher Parts",
          "url": "https://www.partselect.com/Dishwasher-Parts.htm"
        }
      ]
    },
    {
      "name": "Chopper",
      "id": "Chopper",
      "content": "The food chopper, chops up the food particles that were left on your dishes into tiny pieces so that they can easily pass through the drain portion of the dishwasher pump. If the food particles are not chopped finely enough, the debris may prevent the dirty water from draining and could possibly get re-circulated in the dishwasher. If your dishwasher is not cleaning properly, inspect the drain portion of the pump, if you find that there is food debris; check the food chopper to see if it is damaged.\n\nHow to inspect a dishwasher chopper:\n\nDisconnect your appliance from the power source before beginning. In order to access the food chopper, you will need to remove the lower spray arm as well as the spray tower. Once you have access to it, remove the food chopper in order to closely inspect it. Visually inspect the food chopper for any signs of wear, discoloration, damage, or cracking. Remove any debris you may find on or near the chopper. If you find your chopper shows any of the symptoms above, you will need a replacement chopper .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Disconnect your appliance from the power source before beginning."
        },
        {
          "title": "Step 2",
          "content": "In order to access the food chopper, you will need to remove the lower spray arm as well as the spray tower. Once you have access to it, remove the food chopper in order to closely inspect it."
        },
        {
          "title": "Step 3",
          "content": "Visually inspect the food chopper for any signs of wear, discoloration, damage, or cracking. Remove any debris you may find on or near the chopper."
        },
        {
          "title": "Step 4",
          "content": "If you find your chopper shows any of the symptoms above, you will need areplacement chopper."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/392939_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2100006_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/392939_2_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement chopper",
          "category": "Dishwasher Parts",
          "url": "https://www.partselect.com/Dishwasher-Parts.htm"
        }
      ]
    },
    {
      "name": "Water Inlet Valve",
      "id": "WaterInlet",
      "content": "The water inlet valve one of the most common dishwasher parts to fail and could be the cause of a dishwasher that is not cleaning the dishes well, if it is not providing the proper water level in the tub.\n\nHow to inspect a dishwasher water inlet valve:\n\nDisconnect the water supply and the power source from your appliance before beginning this inspection. The water inlet valve is usually located behind the lower access panel. Remove the lower access panel in order to locate the inlet valve. Once you have located it, visually inspect the water inlet valve for any signs of cracking, wear, or other damage. If any issues are found during your inspection, you will need a replacement water inlet valve .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Disconnect the water supply and the power source from your appliance before beginning this inspection."
        },
        {
          "title": "Step 2",
          "content": "The water inlet valve is usually located behind the lower access panel. Remove the lower access panel in order to locate the inlet valve."
        },
        {
          "title": "Step 3",
          "content": "Once you have located it, visually inspect the water inlet valve for any signs of cracking, wear, or other damage."
        },
        {
          "title": "Step 4",
          "content": "If any issues are found during your inspection, you will need areplacement water inlet valve."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/402521_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/887857_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2348011_1_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement water inlet valve",
          "category": "Dishwasher Valves",
          "url": "https://www.partselect.com/Dishwasher-Valves.htm"
        }
      ]
    },
    {
      "name": "Water Delivery Tube",
      "id": "WaterDelivery",
      "content": "If your dishwasher has an upper spray arm, then the water delivery tube may be the cause of the problems. The water delivery tube or wash arm manifold is a tube typically made of plastic that supplies water from the pump to the upper spray arm and on some models to the middle spray arm.\n\nHow to inspect a dishwasher water delivery tube:\n\nUnplug your dishwasher before starting this inspection. Locate your water delivery tube in order to inspect it. You likely will need to remove your dishwasher’s lower access panel. Begin by checking the alignment of the tube, it should be aligned with the spray arms and have no restrictions impeding the flow of water. On some models, there is a filter inside the tube. If this is the case for your dishwasher, inspect the filter to see if it has become plugged. You should also visually inspect your water delivery tube to ensure it is not worn or damaged. If you find any issues while performing the inspections above, you will need a replacement water delivery tube .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Unplug your dishwasher before starting this inspection."
        },
        {
          "title": "Step 2",
          "content": "Locate your water delivery tube in order to inspect it. You likely will need to remove your dishwasher’s lower access panel."
        },
        {
          "title": "Step 3",
          "content": "Begin by checking the alignment of the tube, it should be aligned with the spray arms and have no restrictions impeding the flow of water. On some models, there is a filter inside the tube. If this is the case for your dishwasher, inspect the filter to see if it has become plugged. You should also visually inspect your water delivery tube to ensure it is not worn or damaged."
        },
        {
          "title": "Step 4",
          "content": "If you find any issues while performing the inspections above, you will need areplacement water delivery tube."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/356311_2_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/356311_3_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/356311_1_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement water delivery tube",
          "category": "Dishwasher Hoses and Tubes",
          "url": "https://www.partselect.com/Dishwasher-Hoses-and-Tubes.htm"
        }
      ]
    },
    {
      "name": "Filters",
      "id": "Filters",
      "content": "All dishwashers will have one or more filters to remove food particles from the wash water during the cycle. These filters are typically self-cleaning, but under certain water conditions or detergent usage these filters can become clogged.\n\nHow to inspect dishwasher filters:\n\nUnplug your dishwasher before beginning these inspections. Locate and remove the filters in the circulating portion of the pump and/or in the wash arm manifold. Clean any debris you find in the filters. Visually inspect the filters to see if they have become torn or otherwise damaged. If you find any issues with your filters, you will need a replacement dishwasher filter .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Unplug your dishwasher before beginning these inspections."
        },
        {
          "title": "Step 2",
          "content": "Locate and remove the filters in the circulating portion of the pump and/or in the wash arm manifold."
        },
        {
          "title": "Step 3",
          "content": "Clean any debris you find in the filters. Visually inspect the filters to see if they have become torn or otherwise damaged."
        },
        {
          "title": "Step 4",
          "content": "If you find any issues with your filters, you will need areplacement dishwasher filter."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/401968_1_N.jpg",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/420499_1_N.jpg",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/958919_1_N.jpg"
      ],
      "parts": [
        {
          "name": "replacement dishwasher filter",
          "category": "Dishwasher Filters",
          "url": "https://www.partselect.com/Dishwasher-Filters.htm"
        }
      ]
    },
    {
      "name": "Wash Spinner",
      "id": "WashSpinner",
      "content": "If the third level wash spinner has come loose, is not properly fitted or is cracked, it may be the reason why your dishes are not coming out as clean as they should be.\n\nHow to inspect a dishwasher wash spinner:\n\nTo ensure your safety, unplug your dishwasher before starting. Locate your wash spinner, it will be found on the water feed tube, which is found at the rear of the wash tub. You may need to remove wash arms or other components in order to access it, depending on your model. Inspect the area around the wash spinner to ensure there are no obstructions preventing it from turning freely. You should also visually inspect it for any signs of discoloration, cracking, or damage. If you find your spinner shows any of the above issues, you will need a replacement wash spinner .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "To ensure your safety, unplug your dishwasher before starting."
        },
        {
          "title": "Step 2",
          "content": "Locate your wash spinner, it will be found on the water feed tube, which is found at the rear of the wash tub. You may need to remove wash arms or other components in order to access it, depending on your model."
        },
        {
          "title": "Step 3",
          "content": "Inspect the area around the wash spinner to ensure there are no obstructions preventing it from turning freely. You should also visually inspect it for any signs of discoloration, cracking, or damage."
        },
        {
          "title": "Step 4",
          "content": "If you find your spinner shows any of the above issues, you will need areplacement wash spinner."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/734590_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/972316_2_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/734590_3_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement wash spinner",
          "category": "Dishwasher Parts",
          "url": "https://www.partselect.com/Dishwasher-Parts.htm"
        }
      ]
    },
    {
      "name": "Detergent Dispenser",
      "id": "DetergentDispenser",
      "content": "The detergent dispenser could be the cause of the dishwasher not cleaning your dishes. First, make sure you are using a high-quality detergent, and if you are using gel or tablets, consider switching to a powdered detergent as it dissolves faster. If your detergent cup has a prewash compartment, you could consider adding detergent to this compartment. Make sure you are using enough detergent based on your local water conditions. Hard water will require more detergent than soft water, but be careful to not use too much detergent as you could cause damage to your glassware.\n\nHow to inspect a dishwasher detergent dispenser:\n\nTo ensure your safety, be sure to unplug your appliance before beginning. The detergent dispenser will most likely be found on the inside of the door. You will not need to remove it to perform this inspection. Begin by running a test cycle with detergent in the dispenser to verify that the detergent is being released during the cleaning cycle. If It is, visually inspect the dispenser for any signs of wear or damage. Additionally, you should clean any clogged or caked-on detergent off the dispenser, as this may be preventing the detergent from being released properly. If you find any issues during your inspection, you will need a replacement detergent dispenser .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "To ensure your safety, be sure to unplug your appliance before beginning."
        },
        {
          "title": "Step 2",
          "content": "The detergent dispenser will most likely be found on the inside of the door. You will not need to remove it to perform this inspection."
        },
        {
          "title": "Step 3",
          "content": "Begin by running a test cycle with detergent in the dispenser to verify that the detergent is being released during the cleaning cycle."
        },
        {
          "title": "Step 4",
          "content": "If It is, visually inspect the dispenser for any signs of wear or damage. Additionally, you should clean any clogged or caked-on detergent off the dispenser, as this may be preventing the detergent from being released properly."
        },
        {
          "title": "Step 5",
          "content": "If you find any issues during your inspection, you will need areplacement detergent dispenser."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/1524979_2_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/890594_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/958966_2_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement detergent dispenser",
          "category": "Dishwasher Dispensers",
          "url": "https://www.partselect.com/Dishwasher-Dispensers.htm"
        }
      ]
    },
    {
      "name": "Heating Element",
      "id": "HeatingElement",
      "content": "Dishwashers need adequate hot water to properly clean the dishes, usually about 140 degrees Fahrenheit. The heating element, found at the bottom of the dishwasher is used to maintain the temperature of the water in the dishwasher, or to heat the water higher than normal for certain cycles depending on the cycle option selected. It is important to note that the heating element is not used to heat the water for normal wash cycles, so before checking the heating element, ensure that the water entering your dishwasher is hot enough. Please note that water hotter than 140-150 degrees is not recommended as damage to your dishes can occur with very hot water. Before starting a washing cycle, run the hot water in your sink for a few minutes. If hot water is going into your dishwasher, but the water temperature falls during the cycle even with a heating option selected, then you may need to replace the heating element.\n\nHow to test the heating element in a dishwasher with a multimeter:\n\nBegin by disconnecting your appliance from the power source. Locate your heating element, it will be found on the bottom of the tub and depending on your model, it may have a cover. If it does have a cover, remove it. Remove the lower access panel and disconnect wires attached to the heating element’s terminals that protrude through the base of the dishwasher. Set your multimeter to the Rx1 setting and touch the terminals with the probes. The reading of a functional heating element varies between models but will fall between zero and infinity, refer to your owner’s manual to determine what reading you should receive. If your reading is exactly zero or infinity, it is defective. If your heating element’s reading is outside the manufacturer’s recommended range, you will need a replacement heating element .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Begin by disconnecting your appliance from the power source."
        },
        {
          "title": "Step 2",
          "content": "Locate your heating element, it will be found on the bottom of the tub and depending on your model, it may have a cover. If it does have a cover, remove it."
        },
        {
          "title": "Step 3",
          "content": "Remove the lower access panel and disconnect wires attached to the heating element’s terminals that protrude through the base of the dishwasher."
        },
        {
          "title": "Step 4",
          "content": "Set your multimeter to the Rx1 setting and touch the terminals with the probes. The reading of a functional heating element varies between models but will fall between zero and infinity, refer to your owner’s manual to determine what reading you should receive. If your reading is exactly zero or infinity, it is defective."
        },
        {
          "title": "Step 5",
          "content": "If your heating element’s reading is outside the manufacturer’s recommended range, you will need areplacement heating element."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2355742_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2099740_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2339976_2_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement heating element",
          "category": "Dishwasher Elements and Burners",
          "url": "https://www.partselect.com/Dishwasher-Elements-and-Burners.htm"
        }
      ]
    },
    {
      "name": "Pump Impellers",
      "id": "PumpImpellers",
      "content": "In a dishwasher there are two impellers, the wash impeller and the drain impeller located within the dishwasher’s pump. The wash impeller is the part that circulates the water and pressurizes the spray arms. The drain impeller, if used on your model, is used only to drain the dishwasher.\n\nHow to inspect dishwasher pump impellers:\n\nDisconnect the power source from your dishwasher before starting this inspection. The pump impellers will be found attached to the pump/motor. Depending on your model, you will need to remove all or some of the following parts to access the impellers: lower access panel, spray arm, pump housing, & screen. Once you have access to them, remove the impellers to closely inspect them. Visually inspect your impellers for any signs of cracking, wear, damage, or discoloration. Additionally, ensure that there are no debris preventing them from moving freely when in place. If you find any issues while performing the checks above, you will need replacement impellers .\n\n",
      "repair_solutions": [
        {
          "title": "Step 1",
          "content": "Disconnect the power source from your dishwasher before starting this inspection."
        },
        {
          "title": "Step 2",
          "content": "The pump impellers will be found attached to the pump/motor. Depending on your model, you will need to remove all or some of the following parts to access the impellers: lower access panel, spray arm, pump housing, & screen. Once you have access to them, remove the impellers to closely inspect them."
        },
        {
          "title": "Step 3",
          "content": "Visually inspect your impellers for any signs of cracking, wear, damage, or discoloration. Additionally, ensure that there are no debris preventing them from moving freely when in place."
        },
        {
          "title": "Step 4",
          "content": "If you find any issues while performing the checks above, you will needreplacement impellers."
        }
      ],
      "images": [
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2340860_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2340910_1_N.JPG",
        "https://partselectcom-gtcdcddbene3cpes.z01.azurefd.net/assets/partimages/2363094_1_N.JPG"
      ],
      "parts": [
        {
          "name": "replacement impellers",
          "category": "Dishwasher Parts",
          "url": "https://www.partselect.com/Dishwasher-Parts.htm"
        }
      ]
    }
  ],
  "youtube_tutorials": [
    {
      "title": "How To Fix Dishwasher That Won't Clean Properly",
      "url": "https://www.youtube.com/watch?v=9DqYkzF0qVM"
    }
  ],
  "parts_to_consider": [
    {
      "id": "UpperDischargeHousing",
      "name": "Upper Discharge Housing Gasket"
    },
    {
      "id": "SprayArm",
      "name": "Spray Arm"
    },
    {
      "id": "DockingStation",
      "name": "Docking Station"
    },
    {
      "id": "Chopper",
      "name": "Chopper"
    },
    {
      "id": "WaterInlet",
      "name": "Water Inlet Valve"
    },
    {
      "id": "WaterDelivery",
      "name": "Water Delivery Tube"
    },
    {
      "id": "Filters",
      "name": "Filters"
    },
    {
      "id": "WashSpinner",
      "name": "Wash Spinner"
    },
    {
      "id": "DetergentDispenser",
      "name": "Detergent Dispenser"
    },
    {
      "id": "HeatingElement",
      "name": "Heating Element"
    },
    {
      "id": "PumpImpellers",
      "name": "Pump Impellers"
    }
  ],
  "structured_info": {
    "root_cause_analysis": {
      "Upper Discharge Housing Gasket": "Low pressure from the spray arms due to a loose or damaged upper discharge housing gasket.",
      "Spray Arm": "Plugged holes, cracks, or separated seams in the spray arms can impair the force of the spray, leading to improper cleaning.",
      "Docking Station": "Issues with the docking station along with its flappers can affect water supply to the middle spray arm.",
      "Chopper": "Improperly chopped food particles can prevent proper draining, leading to dirty water recirculation in the dishwasher.",
      "Water Inlet Valve": "Failure of the water inlet valve can result in inadequate water level in the tub, affecting cleaning performance.",
      "Water Delivery Tube": "Misalignment, restrictions, or damage in the water delivery tube can hinder water flow to the upper spray arm.",
      "Filters": "Clogged or damaged filters can impact the dishwasher's ability to remove food particles from the wash water effectively.",
      "Wash Spinner": "Issues with the wash spinner such as being loose, improperly fitted, or cracked can affect dish cleaning."
    },
    "tools_needed": [
      "Safety gloves",
      "Replacement parts (gaskets, spray arms, docking station, chopper, water inlet valve, water delivery tube, filters, wash spinner)",
      "Screwdriver",
      "Inspection mirror",
      "Cleaning brush",
      "Multimeter (for electrical checks)"
    ],
    "safety_precautions": [
      "Always unplug the dishwasher before starting any repair work.",
      "Wear safety gloves to protect your hands from sharp edges and cleaning chemicals."
    ],
    "key_symptoms": {
      "Upper Discharge Housing Gasket": "Low pressure from the spray arms",
      "Spray Arm": "Plugged holes, cracks, separated seams",
      "Docking Station": "Issues with flappers, water supply to middle spray arm",
      "Chopper": "Improperly chopped food particles, dirty water not draining",
      "Water Inlet Valve": "Inadequate water level in the tub",
      "Water Delivery Tube": "Misalignment, restrictions, damage in the water delivery tube",
      "Filters": "Clogged or damaged filters",
      "Wash Spinner": "Loose, improper fitting, cracked wash spinner"
    }
  }
}